#+title: API Demos
#+property: header-args:elisp :results pp

This file contains demos of Doom's public API; its core library, macros, and
autodefs. It is used by the =elisp-demos= package to display examples of their
usage in the documentation displayed by either ~describe-function~ or
~helpful-function~ (on [[kbd:][SPC h f]]).

** appendq!
:PROPERTIES:
:added: pre-3.0.0
:END:
#+begin_src emacs-lisp
(let ((x '(a b c)))
  (appendq! x '(c d e))
  x)
#+end_src

#+RESULTS:
: (a b c c d e)

#+begin_src emacs-lisp
(let ((x '(a b c))
      (y '(c d e))
      (z '(f g)))
  (appendq! x y z '(h))
  x)
#+end_src

#+RESULTS:
: (a b c c d e f g h)

** file-exists-p!
:PROPERTIES:
:added: pre-3.0.0
:END:
#+begin_src emacs-lisp
(file-exists-p! "init.el" doom-emacs-dir)
#+end_src

#+RESULTS:
: /home/hlissner/.emacs.d/init.el

#+begin_src emacs-lisp
(file-exists-p! (and (or "doesnotexist" "init.el")
                     "LICENSE")
                doom-emacs-dir)
#+end_src

#+RESULTS:
: /home/hlissner/.emacs.d/LICENSE

** lambda!
#+begin_src emacs-lisp
(mapcar (lambda! ((&key foo bar baz))
          (list foo bar baz))
        '((:foo 10 :bar 25)
          (:baz hello :boop nil)
          (:bar 42)))
#+end_src

#+RESULTS:
: ((10 25 nil) (nil nil hello) (nil 42 nil))

** fn!
#+begin_src emacs-lisp
(mapcar (fn! (symbol-name %)) '(hello world))
#+end_src

#+RESULTS:
: ("hello" "world")

#+begin_src emacs-lisp
(seq-sort (fn! (string-lessp (symbol-name %1)
                             (symbol-name %2)))
          '(bonzo foo bar buddy doomguy baz zombies))
#+end_src

#+RESULTS:
: (bar baz bonzo buddy doomguy foo zombies)

#+begin_src emacs-lisp
(format "You passed %d arguments to this function"
        (funcall (fn! (length %*)) :foo :bar :baz "hello" 123 t))
#+end_src

#+RESULTS:
: "You passed 6 arguments to this function"

** letenv!
:PROPERTIES:
:added: pre-3.0.0
:END:
#+begin_src emacs-lisp
(letenv! (("SHELL" "/bin/sh"))
  (shell-command-to-string "echo $SHELL"))
#+end_src

#+RESULTS:
: "/bin/sh\n"

** pushnew!
:PROPERTIES:
:added: pre-3.0.0
:END:
#+begin_src emacs-lisp
(let ((list '(a b c)))
  (pushnew! list 'c 'd 'e)
  list)
#+end_src

#+RESULTS:
: (e d a b c)

** prependq!
:PROPERTIES:
:added: pre-3.0.0
:END:
#+begin_src emacs-lisp
(let ((x '(a b c)))
  (prependq! x '(c d e))
  x)
#+end_src

#+RESULTS:
: (c d e a b c)

#+begin_src emacs-lisp
(let ((x '(a b c))
      (y '(c d e))
      (z '(f g)))
  (prependq! x y z '(h))
  x)
#+end_src

#+RESULTS:
: (c d e f g h a b c)

